{
  "total_vocab": 32000,
  "used": 3912,
  "token_counts": {
    "2": 71608,
    "8786": 4795,
    "4461": 111,
    "4256": 159,
    "5555": 518,
    "2810": 23601,
    "3": 71608,
    "3822": 3132,
    "1376": 30,
    "1451": 145,
    "3842": 2283,
    "18601": 119,
    "35": 17395,
    "4828": 5512,
    "12780": 3299,
    "4119": 245,
    "7538": 355,
    "1570": 141,
    "2052": 3174,
    "2275": 4918,
    "1518": 586,
    "2073": 1930,
    "2239": 1283,
    "21225": 647,
    "19": 4169,
    "10611": 1150,
    "11369": 266,
    "15827": 1177,
    "2521": 1291,
    "1556": 10459,
    "1432": 3697,
    "2051": 11974,
    "3785": 2200,
    "6297": 1493,
    "2811": 245,
    "1513": 6828,
    "4761": 119,
    "2086": 121,
    "16278": 115,
    "1428": 241,
    "2259": 3122,
    "4709": 702,
    "1126": 296,
    "9413": 4841,
    "3968": 651,
    "6233": 985,
    "665": 3436,
    "4400": 350,
    "3633": 315,
    "2067": 1709,
    "3797": 434,
    "4082": 381,
    "24": 241,
    "2299": 628,
    "2118": 1239,
    "3910": 1889,
    "12449": 2009,
    "10003": 1577,
    "10214": 1551,
    "2200": 1281,
    "1897": 1564,
    "1571": 3135,
    "8155": 2321,
    "6288": 1728,
    "23": 113,
    "8964": 479,
    "873": 112,
    "1187": 727,
    "6686": 118,
    "1077": 1534,
    "11245": 113,
    "1453": 614,
    "1396": 1236,
    "1097": 2484,
    "1511": 180,
    "2088": 1309,
    "4005": 572,
    "857": 881,
    "16047": 66,
    "10604": 2365,
    "3660": 7070,
    "4204": 1165,
    "732": 712,
    "22409": 255,
    "3766": 743,
    "3915": 2318,
    "2097": 12973,
    "2998": 1055,
    "5306": 238,
    "2282": 239,
    "5167": 1025,
    "2776": 3624,
    "2315": 2706,
    "1176": 1620,
    "1723": 4545,
    "6304": 3906,
    "30993": 273,
    "3889": 2568,
    "3780": 222,
    "1537": 265,
    "2170": 3741,
    "2182": 1975,
    "3856": 116,
    "11966": 616,
    "4836": 1732,
    "14159": 1323,
    "2750": 1337,
    "5247": 4271,
    "2085": 2187,
    "904": 1360,
    "10298": 234,
    "1295": 2519,
    "2318": 3272,
    "5079": 110,
    "4665": 124,
    "3700": 263,
    "1479": 994,
    "14360": 994,
    "5995": 480,
    "2069": 1618,
    "13382": 329,
    "23942": 3581,
    "1728": 364,
    "5753": 405,
    "2424": 21,
    "2047": 24,
    "2267": 82,
    "7212": 134,
    "746": 25,
    "1099": 62,
    "1892": 403,
    "3769": 135,
    "1175": 214,
    "4450": 864,
    "13987": 1024,
    "4071": 386,
    "7579": 162,
    "6228": 57,
    "2039": 310,
    "23638": 37,
    "87": 415,
    "23513": 256,
    "4868": 254,
    "2009": 184,
    "5062": 915,
    "74": 161,
    "21429": 11,
    "79": 1033,
    "11141": 901,
    "2041": 599,
    "3686": 723,
    "814": 438,
    "4291": 457,
    "1": 257,
    "9574": 3636,
    "7425": 363,
    "7057": 1855,
    "543": 416,
    "4527": 123,
    "8201": 279,
    "7317": 268,
    "1889": 370,
    "2180": 618,
    "13571": 1429,
    "2506": 1274,
    "2677": 1205,
    "8327": 348,
    "10770": 382,
    "3738": 423,
    "2517": 750,
    "1504": 240,
    "4388": 233,
    "717": 638,
    "2079": 779,
    "4152": 159,
    "1421": 494,
    "4140": 188,
    "2116": 2204,
    "11092": 108,
    "8405": 108,
    "901": 103,
    "10780": 82,
    "1389": 41,
    "2700": 31,
    "1875": 347,
    "2482": 138,
    "6052": 137,
    "1567": 40,
    "13964": 180,
    "20650": 218,
    "3922": 3623,
    "3616": 1373,
    "6328": 461,
    "3863": 119,
    "25949": 589,
    "5361": 578,
    "2016": 639,
    "5131": 526,
    "2223": 4246,
    "5971": 3337,
    "5809": 2966,
    "17993": 74,
    "7598": 284,
    "2181": 460,
    "10874": 861,
    "4813": 681,
    "18581": 686,
    "4408": 730,
    "27444": 580,
    "859": 1754,
    "2209": 479,
    "18125": 102,
    "2119": 922,
    "2075": 2167,
    "752": 344,
    "1507": 310,
    "9509": 2249,
    "4056": 413,
    "6896": 2036,
    "4635": 212,
    "5495": 850,
    "13673": 114,
    "1269": 656,
    "16814": 934,
    "721": 94,
    "837": 143,
    "2062": 251,
    "9282": 91,
    "6994": 179,
    "3744": 242,
    "5382": 59,
    "7574": 56,
    "27135": 427,
    "4178": 34,
    "10489": 177,
    "3912": 272,
    "3674": 139,
    "1378": 457,
    "3897": 752,
    "23522": 60,
    "22035": 32,
    "1935": 824,
    "2533": 1246,
    "2015": 1196,
    "24687": 204,
    "28093": 49,
    "2076": 188,
    "11356": 156,
    "26292": 10,
    "3988": 106,
    "25501": 7,
    "10211": 77,
    "5936": 81,
    "19665": 40,
    "2175": 374,
    "4110": 308,
    "5447": 326,
    "4607": 1069,
    "544": 816,
    "1329": 700,
    "2129": 746,
    "2689": 2082,
    "6992": 19,
    "568": 212,
    "19521": 357,
    "1335": 734,
    "7189": 167,
    "809": 687,
    "5016": 252,
    "1041": 836,
    "2448": 202,
    "83": 211,
    "4020": 239,
    "4906": 204,
    "16434": 229,
    "7322": 205,
    "9614": 228,
    "10624": 384,
    "27326": 191,
    "17669": 628,
    "5240": 1198,
    "4920": 269,
    "9926": 372,
    "4069": 859,
    "4155": 91,
    "7716": 163,
    "2210": 196,
    "3618": 123,
    "3732": 422,
    "9932": 240,
    "4149": 673,
    "4604": 178,
    "1081": 55,
    "2230": 57,
    "5643": 352,
    "2138": 664,
    "4999": 129,
    "3729": 243,
    "1564": 52,
    "9893": 110,
    "17252": 4,
    "11683": 887,
    "8718": 696,
    "6041": 77,
    "15863": 628,
    "69": 427,
    "10790": 158,
    "16962": 99,
    "7920": 34,
    "16828": 17,
    "2012": 378,
    "8315": 216,
    "17939": 8,
    "14050": 1976,
    "6494": 174,
    "4806": 118,
    "3702": 160,
    "5974": 426,
    "4887": 48,
    "10188": 299,
    "11256": 14,
    "5566": 66,
    "22": 291,
    "18947": 1533,
    "19801": 30,
    "2033": 30,
    "4729": 156,
    "5697": 1245,
    "1589": 1183,
    "1388": 275,
    "4942": 460,
    "4252": 614,
    "7944": 128,
    "2391": 697,
    "9335": 208,
    "24576": 236,
    "14499": 236,
    "18386": 178,
    "5611": 147,
    "943": 13,
    "7179": 424,
    "1124": 213,
    "3801": 117,
    "1151": 8,
    "2645": 203,
    "5071": 347,
    "2053": 443,
    "2529": 237,
    "9972": 42,
    "4054": 925,
    "18246": 790,
    "3046": 343,
    "6706": 145,
    "2496": 263,
    "2460": 396,
    "4420": 156,
    "22843": 1306,
    "7543": 194,
    "2205": 1055,
    "2203": 219,
    "7881": 376,
    "1288": 328,
    "7866": 140,
    "3943": 823,
    "8466": 32,
    "813": 1329,
    "2227": 2070,
    "3760": 629,
    "15299": 101,
    "25051": 55,
    "4350": 259,
    "13348": 112,
    "21934": 92,
    "14633": 36,
    "2007": 182,
    "7052": 680,
    "82": 31,
    "2010": 181,
    "15743": 35,
    "7229": 44,
    "2040": 43,
    "29536": 102,
    "18": 812,
    "7481": 634,
    "2367": 143,
    "4296": 439,
    "858": 170,
    "18781": 103,
    "24472": 42,
    "22915": 40,
    "5792": 1298,
    "9684": 34,
    "7952": 5,
    "2470": 573,
    "6965": 43,
    "15095": 394,
    "5857": 749,
    "2431": 60,
    "5110": 428,
    "21546": 181,
    "1169": 714,
    "8320": 8,
    "6396": 20,
    "780": 153,
    "548": 3,
    "5616": 79,
    "2201": 75,
    "4117": 422,
    "1424": 137,
    "2472": 134,
    "1688": 367,
    "5420": 746,
    "28": 63,
    "3093": 4,
    "2173": 12,
    "15098": 1129,
    "3651": 736,
    "13202": 2,
    "7868": 7,
    "5037": 21,
    "9612": 18,
    "5602": 404,
    "4033": 371,
    "4044": 451,
    "24368": 10,
    "1545": 212,
    "2219": 261,
    "6951": 215,
    "17471": 119,
    "18140": 113,
    "6639": 320,
    "6236": 330,
    "3641": 1009,
    "2183": 220,
    "12047": 177,
    "831": 160,
    "6005": 202,
    "11385": 15,
    "1121": 39,
    "2892": 10,
    "6395": 229,
    "17695": 175,
    "8331": 209,
    "3359": 72,
    "5376": 435,
    "11520": 303,
    "2145": 618,
    "6517": 316,
    "2024": 488,
    "22992": 140,
    "3934": 286,
    "7802": 135,
    "1586": 47,
    "9156": 6,
    "1118": 2,
    "5665": 4,
    "22457": 50,
    "6565": 200,
    "1411": 41,
    "1565": 166,
    "18395": 136,
    "1446": 88,
    "575": 296,
    "555": 312,
    "11082": 134,
    "2194": 167,
    "4107": 308,
    "3057": 195,
    "3761": 71,
    "28006": 205,
    "1484": 4,
    "29680": 2,
    "4577": 3,
    "1144": 3,
    "4869": 297,
    "1458": 256,
    "1943": 132,
    "11465": 143,
    "2491": 445,
    "1116": 122,
    "8791": 258,
    "2643": 258,
    "27": 306,
    "1629": 83,
    "2140": 104,
    "547": 305,
    "14653": 85,
    "10294": 99,
    "6202": 226,
    "15038": 2,
    "3621": 15,
    "5591": 20,
    "1653": 2,
    "2155": 285,
    "13836": 27,
    "14186": 22,
    "9230": 155,
    "80": 210,
    "10647": 42,
    "3762": 138,
    "5613": 169,
    "4434": 164,
    "73": 254,
    "3947": 154,
    "9098": 214,
    "16012": 42,
    "2322": 90,
    "1284": 40,
    "1325": 142,
    "2370": 65,
    "10700": 43,
    "9400": 19,
    "30632": 32,
    "4136": 336,
    "6654": 119,
    "1443": 93,
    "3011": 14,
    "1091": 1299,
    "1338": 152,
    "6468": 205,
    "5883": 143,
    "5043": 19,
    "9326": 128,
    "1500": 87,
    "2199": 346,
    "3980": 272,
    "5972": 256,
    "5520": 198,
    "2603": 101,
    "4435": 116,
    "2343": 597,
    "9249": 575,
    "4517": 35,
    "4402": 39,
    "21951": 2,
    "14944": 9,
    "4232": 115,
    "1522": 413,
    "3254": 50,
    "2027": 411,
    "2679": 130,
    "11738": 133,
    "1141": 230,
    "3999": 121,
    "11065": 6,
    "7718": 91,
    "9430": 80,
    "8627": 115,
    "10598": 75,
    "2362": 10,
    "1528": 345,
    "2467": 286,
    "20004": 450,
    "15558": 19,
    "12189": 112,
    "3838": 143,
    "4373": 112,
    "13046": 214,
    "21309": 126,
    "4281": 222,
    "3771": 197,
    "24374": 100,
    "1560": 240,
    "9384": 111,
    "6611": 616,
    "23371": 534,
    "4105": 530,
    "18064": 245,
    "31444": 69,
    "16741": 184,
    "8433": 65,
    "3133": 65,
    "720": 204,
    "4154": 29,
    "1882": 4,
    "1891": 80,
    "558": 48,
    "5794": 2,
    "4647": 16,
    "1445": 116,
    "15682": 111,
    "886": 330,
    "636": 66,
    "881": 66,
    "86": 342,
    "4412": 289,
    "21287": 207,
    "18529": 224,
    "14970": 37,
    "14766": 39,
    "6365": 166,
    "89": 52,
    "14610": 51,
    "5083": 53,
    "2013": 397,
    "2270": 169,
    "2287": 202,
    "27483": 2,
    "3916": 28,
    "9544": 8,
    "3800": 3,
    "16401": 63,
    "4240": 21,
    "3711": 306,
    "5499": 74,
    "3676": 274,
    "11622": 8,
    "1122": 92,
    "8185": 336,
    "1300": 68,
    "11864": 174,
    "19159": 146,
    "3665": 13,
    "646": 2,
    "4100": 5,
    "3875": 38,
    "16644": 121,
    "19093": 156,
    "4137": 42,
    "22078": 86,
    "5413": 78,
    "3699": 60,
    "6102": 37,
    "2289": 95,
    "1762": 108,
    "4713": 138,
    "3682": 137,
    "3731": 134,
    "4313": 176,
    "5530": 4,
    "14541": 8,
    "7245": 251,
    "30707": 2,
    "2255": 27,
    "2600": 2,
    "15221": 2,
    "4209": 162,
    "3630": 107,
    "4144": 77,
    "2231": 45,
    "10088": 87,
    "24742": 307,
    "21572": 39,
    "3201": 4,
    "5949": 11,
    "9586": 2,
    "5889": 434,
    "1076": 135,
    "10948": 20,
    "4440": 226,
    "5399": 128,
    "12864": 181,
    "6443": 255,
    "2435": 235,
    "5999": 158,
    "8478": 153,
    "16383": 13,
    "5349": 113,
    "4399": 237,
    "17219": 233,
    "19705": 131,
    "8919": 129,
    "21570": 105,
    "23785": 19,
    "5164": 70,
    "5148": 39,
    "90": 223,
    "24298": 106,
    "5213": 5,
    "9": 12,
    "743": 357,
    "3679": 220,
    "2359": 207,
    "11921": 39,
    "11376": 150,
    "15160": 10,
    "4586": 228,
    "85": 227,
    "31108": 156,
    "4948": 116,
    "2165": 122,
    "2328": 121,
    "3787": 4,
    "3092": 4,
    "9389": 7,
    "10114": 126,
    "28156": 2,
    "7711": 2,
    "4750": 451,
    "1677": 219,
    "4489": 316,
    "2113": 322,
    "16054": 33,
    "17447": 4,
    "2167": 4,
    "21786": 7,
    "7301": 85,
    "4880": 247,
    "6452": 64,
    "11765": 55,
    "3606": 50,
    "1632": 399,
    "5733": 114,
    "1002": 130,
    "2264": 130,
    "12246": 2,
    "10618": 2,
    "6159": 12,
    "1365": 126,
    "887": 29,
    "2633": 27,
    "6186": 199,
    "5228": 407,
    "4022": 14,
    "726": 16,
    "10283": 131,
    "3619": 252,
    "14935": 14,
    "5170": 8,
    "1503": 130,
    "4896": 58,
    "10160": 104,
    "13197": 40,
    "8594": 54,
    "76": 151,
    "11": 527,
    "71": 240,
    "14825": 43,
    "4065": 48,
    "14489": 20,
    "10189": 143,
    "21349": 105,
    "10488": 42,
    "29178": 68,
    "9255": 108,
    "19763": 153,
    "4583": 15,
    "4051": 187,
    "3944": 3,
    "6502": 63,
    "5723": 201,
    "1872": 5,
    "2625": 2,
    "28163": 75,
    "3690": 40,
    "6867": 146,
    "20279": 222,
    "7048": 305,
    "20817": 186,
    "3972": 29,
    "3950": 46,
    "3774": 116,
    "3826": 204,
    "9051": 42,
    "9332": 42,
    "4416": 109,
    "3611": 41,
    "9729": 343,
    "1536": 9,
    "4177": 46,
    "20405": 7,
    "23220": 170,
    "18268": 114,
    "4040": 94,
    "30084": 54,
    "3740": 79,
    "2535": 16,
    "16809": 58,
    "19029": 63,
    "21": 31,
    "2624": 22,
    "3824": 453,
    "769": 3,
    "2144": 14,
    "24972": 2,
    "12144": 2,
    "11050": 8,
    "5084": 211,
    "2185": 166,
    "12091": 36,
    "8111": 143,
    "13844": 129,
    "1397": 22,
    "4867": 128,
    "8133": 114,
    "1366": 111,
    "3834": 4,
    "2897": 141,
    "992": 8,
    "6665": 8,
    "2031": 184,
    "1498": 26,
    "29": 233,
    "2096": 234,
    "1508": 261,
    "1755": 2,
    "2345": 9,
    "5523": 13,
    "6962": 10,
    "2835": 2,
    "7034": 23,
    "4497": 15,
    "15431": 10,
    "25808": 122,
    "2008": 199,
    "8672": 78,
    "23828": 7,
    "25112": 35,
    "20669": 44,
    "1697": 13,
    "2461": 9,
    "9263": 145,
    "5930": 29,
    "13232": 23,
    "75": 143,
    "6306": 91,
    "6193": 97,
    "6588": 67,
    "19760": 80,
    "6375": 34,
    "3718": 89,
    "21835": 90,
    "6259": 113,
    "30062": 93,
    "739": 129,
    "2477": 445,
    "15936": 670,
    "4881": 81,
    "15811": 185,
    "30806": 260,
    "2147": 407,
    "2949": 156,
    "2536": 43,
    "8514": 131,
    "3166": 131,
    "5458": 102,
    "18558": 9,
    "15452": 10,
    "25641": 33,
    "2011": 50,
    "17085": 125,
    "14134": 17,
    "29110": 165,
    "7982": 137,
    "8443": 32,
    "19303": 31,
    "29318": 39,
    "10613": 29,
    "13530": 197,
    "5695": 103,
    "1129": 185,
    "6249": 2,
    "3604": 110,
    "4528": 2,
    "1061": 5,
    "4318": 134,
    "1652": 13,
    "2251": 19,
    "2353": 21,
    "615": 35,
    "2640": 59,
    "761": 34,
    "2104": 8,
    "3631": 11,
    "21308": 19,
    "23409": 2,
    "703": 246,
    "26": 396,
    "9122": 290,
    "1472": 281,
    "2388": 281,
    "31344": 11,
    "8300": 14,
    "25419": 4,
    "17619": 35,
    "10": 5,
    "20452": 12,
    "17": 33,
    "8751": 5,
    "20055": 5,
    "9573": 46,
    "2530": 19,
    "578": 52,
    "5181": 165,
    "6461": 42,
    "11379": 160,
    "11262": 150,
    "2290": 372,
    "2334": 139,
    "5506": 127,
    "6008": 90,
    "10423": 68,
    "20511": 6,
    "5793": 39,
    "4790": 18,
    "3965": 97,
    "2056": 120,
    "2133": 105,
    "2179": 123,
    "18119": 86,
    "13753": 2,
    "2112": 161,
    "2154": 503,
    "601": 52,
    "2332": 112,
    "2951": 95,
    "13091": 51,
    "4467": 1060,
    "9214": 430,
    "29098": 71,
    "6924": 116,
    "2540": 362,
    "2048": 43,
    "1656": 128,
    "2232": 213,
    "20640": 343,
    "19862": 43,
    "2157": 40,
    "788": 13,
    "2417": 118,
    "2351": 62,
    "11388": 27,
    "1326": 27,
    "2759": 33,
    "7040": 31,
    "6882": 7,
    "13612": 38,
    "3117": 38,
    "5922": 30,
    "15869": 15,
    "4733": 15,
    "6234": 2,
    "991": 42,
    "3657": 21,
    "4188": 213,
    "2577": 212,
    "14063": 15,
    "3953": 69,
    "848": 124,
    "2346": 124,
    "2609": 55,
    "4582": 4,
    "8194": 99,
    "2283": 75,
    "3795": 35,
    "6526": 89,
    "22353": 5,
    "3642": 4,
    "7587": 37,
    "12234": 177,
    "25176": 8,
    "1497": 57,
    "1236": 17,
    "10398": 32,
    "21078": 95,
    "577": 101,
    "2428": 101,
    "3677": 188,
    "4207": 165,
    "8376": 14,
    "3706": 167,
    "6004": 109,
    "5412": 49,
    "7847": 44,
    "723": 12,
    "2886": 44,
    "25671": 12,
    "6163": 96,
    "12584": 92,
    "1038": 176,
    "13952": 34,
    "11311": 18,
    "29718": 18,
    "4499": 6,
    "22604": 17,
    "9918": 17,
    "16348": 71,
    "9025": 35,
    "30667": 81,
    "8398": 84,
    "17630": 34,
    "8537": 41,
    "20027": 50,
    "3041": 2,
    "2515": 6,
    "2415": 154,
    "4438": 55,
    "4041": 161,
    "14454": 62,
    "26911": 23,
    "2260": 231,
    "23382": 49,
    "8031": 49,
    "5998": 31,
    "19835": 29,
    "4529": 6,
    "3925": 50,
    "20588": 46,
    "8947": 11,
    "19341": 4,
    "1244": 180,
    "11314": 115,
    "9670": 38,
    "8451": 16,
    "4061": 62,
    "3656": 52,
    "5390": 134,
    "5913": 408,
    "8704": 106,
    "6207": 126,
    "4172": 6,
    "5501": 34,
    "1552": 39,
    "2742": 31,
    "13089": 205,
    "4531": 4,
    "11193": 85,
    "4990": 92,
    "8052": 141,
    "4122": 163,
    "4123": 2,
    "4293": 15,
    "4798": 138,
    "4431": 135,
    "10843": 2,
    "2763": 2,
    "6442": 20,
    "5414": 39,
    "7166": 100,
    "19119": 63,
    "9678": 41,
    "4367": 13,
    "5704": 144,
    "6092": 14,
    "1248": 6,
    "2288": 4,
    "4565": 5,
    "2151": 53,
    "28365": 55,
    "13615": 8,
    "6859": 4,
    "3890": 68,
    "4860": 237,
    "10187": 6,
    "4705": 87,
    "4873": 2,
    "798": 85,
    "3776": 29,
    "1517": 20,
    "2408": 4,
    "2225": 15,
    "2605": 9,
    "1054": 2,
    "3381": 2,
    "2398": 2,
    "7464": 17,
    "4212": 112,
    "18910": 2,
    "28038": 19,
    "21504": 12,
    "12437": 105,
    "6449": 39,
    "25318": 3,
    "10436": 119,
    "16023": 27,
    "7972": 67,
    "78": 176,
    "23915": 133,
    "14657": 3,
    "1123": 19,
    "3712": 74,
    "24102": 96,
    "5357": 42,
    "14373": 48,
    "10917": 23,
    "2588": 35,
    "2621": 158,
    "20302": 17,
    "31302": 65,
    "1830": 16,
    "3603": 21,
    "4421": 4,
    "68": 225,
    "6492": 46,
    "10190": 13,
    "14446": 8,
    "2036": 99,
    "10364": 6,
    "16871": 6,
    "2064": 200,
    "19848": 43,
    "5011": 130,
    "31322": 31,
    "15360": 2,
    "2522": 28,
    "18732": 2,
    "14584": 30,
    "2547": 27,
    "3670": 109,
    "3932": 13,
    "1276": 17,
    "2546": 17,
    "6213": 148,
    "11095": 10,
    "2046": 53,
    "8229": 2,
    "5416": 52,
    "29840": 56,
    "5721": 7,
    "4210": 125,
    "13931": 101,
    "3852": 102,
    "9005": 18,
    "70": 117,
    "5660": 8,
    "30728": 8,
    "3827": 27,
    "1754": 43,
    "1195": 46,
    "15543": 2,
    "88": 21,
    "1478": 5,
    "3734": 18,
    "6352": 62,
    "3704": 207,
    "4842": 138,
    "2379": 189,
    "4320": 152,
    "9734": 2,
    "3759": 167,
    "20812": 19,
    "4764": 35,
    "3662": 46,
    "17869": 38,
    "16060": 56,
    "10484": 78,
    "10659": 66,
    "16628": 38,
    "4442": 16,
    "6040": 6,
    "7843": 6,
    "11846": 22,
    "1039": 25,
    "1173": 101,
    "4865": 5,
    "11183": 3,
    "7351": 5,
    "20262": 1,
    "3343": 1,
    "5533": 121,
    "3809": 368,
    "5891": 28,
    "4211": 35,
    "25009": 27,
    "5749": 23,
    "16763": 3,
    "2371": 124,
    "9931": 2,
    "5748": 15,
    "16130": 15,
    "21147": 27,
    "16480": 21,
    "5436": 24,
    "15785": 139,
    "4039": 90,
    "2403": 37,
    "16254": 53,
    "21128": 24,
    "2054": 33,
    "28725": 78,
    "22701": 53,
    "3788": 59,
    "4475": 80,
    "1521": 32,
    "7862": 33,
    "9100": 35,
    "2284": 40,
    "8861": 71,
    "11254": 131,
    "20243": 129,
    "4814": 130,
    "4551": 144,
    "882": 145,
    "12045": 125,
    "5674": 6,
    "3898": 48,
    "20098": 37,
    "12569": 45,
    "2037": 23,
    "15176": 14,
    "5490": 42,
    "2005": 39,
    "5562": 161,
    "6828": 71,
    "5961": 81,
    "18213": 6,
    "7113": 11,
    "8626": 50,
    "26067": 18,
    "12174": 27,
    "15741": 2,
    "7152": 26,
    "15909": 12,
    "13371": 88,
    "1460": 34,
    "3883": 6,
    "7635": 2,
    "2177": 22,
    "12565": 28,
    "16668": 18,
    "8335": 2,
    "8034": 2,
    "1394": 8,
    "6183": 33,
    "4993": 53,
    "2505": 145,
    "7555": 2,
    "2404": 2,
    "15889": 10,
    "823": 19,
    "1902": 47,
    "6535": 40,
    "15408": 49,
    "5389": 78,
    "4930": 73,
    "1117": 19,
    "6148": 6,
    "24658": 1,
    "22640": 59,
    "28587": 2,
    "27616": 155,
    "4886": 23,
    "14797": 16,
    "10467": 4,
    "14207": 4,
    "27175": 7,
    "11340": 49,
    "3956": 25,
    "2712": 49,
    "5232": 24,
    "5031": 30,
    "5937": 23,
    "2233": 9,
    "1202": 35,
    "1332": 32,
    "2063": 55,
    "4455": 10,
    "13895": 2,
    "11130": 4,
    "2520": 34,
    "10140": 201,
    "13559": 2,
    "3647": 20,
    "1644": 15,
    "4390": 2,
    "20309": 9,
    "20249": 46,
    "28677": 28,
    "21383": 18,
    "21859": 28,
    "6080": 15,
    "4939": 98,
    "11226": 106,
    "22327": 40,
    "6582": 39,
    "7536": 101,
    "15013": 28,
    "4515": 33,
    "7744": 17,
    "10443": 33,
    "14271": 11,
    "25044": 1,
    "15957": 5,
    "3666": 36,
    "19837": 2,
    "18610": 19,
    "3721": 118,
    "8758": 12,
    "14789": 4,
    "5274": 4,
    "3639": 2,
    "13163": 5,
    "1967": 4,
    "2043": 25,
    "5276": 2,
    "3643": 33,
    "14352": 2,
    "4603": 8,
    "1439": 24,
    "2142": 43,
    "2418": 26,
    "647": 40,
    "4683": 38,
    "21286": 2,
    "3882": 2,
    "21528": 2,
    "5720": 51,
    "6775": 4,
    "2393": 3,
    "5259": 4,
    "6664": 2,
    "2228": 7,
    "4316": 11,
    "9000": 28,
    "21142": 3,
    "6076": 53,
    "2918": 143,
    "17567": 27,
    "4035": 30,
    "7088": 7,
    "27697": 5,
    "26289": 13,
    "21933": 14,
    "8162": 25,
    "9057": 42,
    "21771": 2,
    "23548": 10,
    "3805": 6,
    "28732": 1,
    "13899": 4,
    "8736": 2,
    "1400": 8,
    "10554": 87,
    "25": 25,
    "12874": 8,
    "8383": 20,
    "19700": 20,
    "3625": 26,
    "2366": 1,
    "7339": 8,
    "2414": 22,
    "15346": 11,
    "28260": 24,
    "7008": 63,
    "4538": 56,
    "23114": 2,
    "2564": 2,
    "8021": 14,
    "3936": 7,
    "2250": 6,
    "5452": 71,
    "3098": 34,
    "7086": 37,
    "7068": 11,
    "7325": 36,
    "3743": 6,
    "30482": 8,
    "15855": 15,
    "2238": 15,
    "4698": 53,
    "8493": 13,
    "2425": 4,
    "3707": 79,
    "5172": 8,
    "860": 5,
    "12388": 6,
    "81": 48,
    "4704": 94,
    "16470": 95,
    "13263": 110,
    "24231": 23,
    "1710": 65,
    "17676": 84,
    "16848": 18,
    "1351": 43,
    "9253": 27,
    "4666": 2,
    "5127": 10,
    "4949": 2,
    "7047": 91,
    "2395": 6,
    "1535": 149,
    "3739": 11,
    "8588": 29,
    "3853": 10,
    "9516": 18,
    "5596": 4,
    "11285": 8,
    "5576": 2,
    "2125": 10,
    "7699": 2,
    "4967": 5,
    "5134": 1,
    "3969": 4,
    "11771": 18,
    "18481": 18,
    "2045": 62,
    "3997": 2,
    "7124": 3,
    "12320": 4,
    "6697": 6,
    "12432": 2,
    "5082": 54,
    "8395": 37,
    "27053": 15,
    "2256": 21,
    "14104": 2,
    "2030": 108,
    "16287": 12,
    "21454": 9,
    "4132": 29,
    "5260": 26,
    "22971": 19,
    "1345": 16,
    "7036": 51,
    "4352": 49,
    "16050": 33,
    "16845": 18,
    "7084": 30,
    "3976": 68,
    "17293": 5,
    "4670": 33,
    "17304": 44,
    "24208": 38,
    "12876": 9,
    "16": 161,
    "66": 59,
    "4580": 36,
    "1856": 41,
    "11739": 42,
    "8582": 3,
    "1047": 15,
    "5673": 4,
    "20765": 22,
    "2532": 15,
    "18814": 6,
    "29919": 16,
    "6749": 17,
    "3815": 20,
    "8372": 45,
    "1282": 77,
    "18962": 2,
    "19607": 2,
    "21764": 4,
    "12405": 65,
    "9739": 72,
    "20118": 26,
    "1316": 6,
    "2137": 7,
    "2160": 8,
    "14084": 2,
    "2093": 2,
    "4328": 34,
    "16044": 2,
    "24740": 2,
    "5677": 42,
    "3634": 46,
    "6959": 6,
    "4816": 2,
    "4182": 26,
    "13680": 72,
    "5882": 86,
    "9755": 27,
    "15537": 1,
    "4883": 1,
    "4748": 3,
    "3724": 12,
    "9581": 1,
    "14574": 2,
    "1726": 2,
    "2162": 4,
    "4158": 18,
    "2595": 18,
    "6226": 13,
    "10090": 25,
    "4634": 74,
    "8559": 15,
    "4824": 16,
    "8637": 104,
    "6133": 46,
    "9537": 29,
    "5528": 5,
    "9127": 122,
    "2121": 132,
    "20733": 11,
    "8101": 20,
    "2688": 22,
    "12551": 15,
    "37": 9,
    "38": 9,
    "4142": 4,
    "4996": 16,
    "6239": 1,
    "8452": 13,
    "3841": 53,
    "1242": 9,
    "6176": 2,
    "7291": 35,
    "5205": 18,
    "7069": 3,
    "3994": 9,
    "22819": 12,
    "2585": 10,
    "2242": 1,
    "19195": 26,
    "2507": 20,
    "23677": 6,
    "4016": 22,
    "5012": 17,
    "8598": 25,
    "7842": 21,
    "14204": 40,
    "4493": 44,
    "13308": 2,
    "20563": 42,
    "13632": 12,
    "11707": 4,
    "7331": 21,
    "8969": 20,
    "23356": 11,
    "10269": 6,
    "25357": 6,
    "11711": 19,
    "13940": 10,
    "20956": 20,
    "29961": 8,
    "11171": 12,
    "12018": 2,
    "11247": 8,
    "26975": 2,
    "5248": 6,
    "15728": 17,
    "26713": 14,
    "2006": 40,
    "15737": 11,
    "1739": 80,
    "2953": 80,
    "12664": 1,
    "2651": 1,
    "3628": 5,
    "13679": 5,
    "15210": 20,
    "5305": 19,
    "5483": 4,
    "14887": 11,
    "4323": 63,
    "23360": 104,
    "3937": 13,
    "5159": 19,
    "18990": 23,
    "21414": 34,
    "186": 4,
    "2755": 6,
    "2188": 4,
    "2317": 4,
    "23847": 5,
    "15271": 5,
    "25784": 7,
    "4960": 44,
    "8979": 23,
    "8084": 43,
    "18697": 88,
    "2089": 14,
    "5842": 2,
    "2443": 10,
    "1540": 23,
    "1692": 16,
    "5433": 61,
    "1156": 11,
    "1233": 33,
    "3658": 8,
    "13508": 8,
    "21372": 10,
    "3806": 9,
    "18408": 4,
    "21266": 20,
    "10164": 20,
    "29932": 29,
    "8146": 2,
    "1160": 33,
    "28361": 10,
    "17896": 20,
    "5834": 68,
    "10676": 68,
    "20548": 47,
    "6677": 10,
    "8481": 24,
    "2377": 52,
    "5511": 4,
    "4068": 7,
    "1163": 2,
    "2449": 6,
    "8565": 4,
    "10492": 2,
    "11570": 51,
    "5732": 2,
    "751": 70,
    "23045": 16,
    "7619": 51,
    "29836": 11,
    "5405": 172,
    "7742": 28,
    "23075": 2,
    "3949": 42,
    "5830": 14,
    "6064": 10,
    "8022": 21,
    "30356": 22,
    "10420": 21,
    "5044": 13,
    "29787": 2,
    "30813": 2,
    "7801": 10,
    "1107": 52,
    "2907": 8,
    "3978": 11,
    "7387": 2,
    "6946": 6,
    "4781": 1,
    "706": 2,
    "17616": 7,
    "1380": 23,
    "5162": 3,
    "6291": 2,
    "1311": 2,
    "11240": 4,
    "6767": 2,
    "11620": 26,
    "17953": 18,
    "14392": 11,
    "4620": 19,
    "11161": 6,
    "3790": 4,
    "5437": 10,
    "5772": 27,
    "30049": 6,
    "9633": 6,
    "4092": 54,
    "7521": 2,
    "4641": 4,
    "22198": 2,
    "27538": 10,
    "3667": 2,
    "26746": 10,
    "8347": 3,
    "10471": 2,
    "3629": 6,
    "604": 8,
    "7066": 5,
    "4808": 17,
    "72": 12,
    "15070": 6,
    "4206": 5,
    "4981": 5,
    "4157": 8,
    "1495": 16,
    "2161": 28,
    "2279": 16,
    "6388": 158,
    "3768": 3,
    "23340": 2,
    "1506": 52,
    "23198": 52,
    "1050": 19,
    "2191": 10,
    "5623": 1,
    "4549": 8,
    "12321": 11,
    "29797": 2,
    "1583": 20,
    "2514": 12,
    "29244": 4,
    "27669": 3,
    "19563": 3,
    "21554": 2,
    "18599": 13,
    "12235": 11,
    "4028": 18,
    "13912": 6,
    "10968": 89,
    "28856": 2,
    "3648": 44,
    "22273": 14,
    "17177": 1,
    "6995": 5,
    "4225": 8,
    "545": 27,
    "3894": 10,
    "2757": 3,
    "8971": 1,
    "4319": 3,
    "18739": 4,
    "6": 31,
    "5193": 8,
    "3747": 1,
    "10905": 24,
    "1668": 17,
    "815": 4,
    "16658": 2,
    "2798": 4,
    "11850": 33,
    "5876": 7,
    "10724": 38,
    "7861": 6,
    "11431": 5,
    "29368": 11,
    "7811": 52,
    "31439": 15,
    "8143": 32,
    "13352": 12,
    "12862": 6,
    "22266": 6,
    "6109": 4,
    "4258": 2,
    "3703": 11,
    "2068": 35,
    "1741": 3,
    "31202": 53,
    "19742": 26,
    "1930": 45,
    "4937": 9,
    "6980": 6,
    "10110": 2,
    "25478": 2,
    "7364": 8,
    "3954": 6,
    "5443": 12,
    "5121": 2,
    "11061": 20,
    "5024": 20,
    "21688": 18,
    "4938": 8,
    "27202": 9,
    "842": 16,
    "2667": 17,
    "2898": 19,
    "2094": 8,
    "7545": 2,
    "2158": 4,
    "5703": 17,
    "2169": 18,
    "18556": 17,
    "14027": 44,
    "10810": 3,
    "1120": 9,
    "7567": 7,
    "7285": 30,
    "17854": 24,
    "19238": 4,
    "6351": 14,
    "8844": 29,
    "7856": 20,
    "2850": 13,
    "25606": 2,
    "7070": 6,
    "17477": 2,
    "21189": 2,
    "10993": 16,
    "5065": 28,
    "1164": 51,
    "2272": 33,
    "3908": 12,
    "2446": 17,
    "2211": 43,
    "4290": 8,
    "19836": 2,
    "7376": 6,
    "6772": 9,
    "30941": 4,
    "4358": 6,
    "4695": 4,
    "20750": 5,
    "4749": 4,
    "10550": 24,
    "21305": 8,
    "22209": 12,
    "9535": 26,
    "7094": 1,
    "7701": 1,
    "1322": 3,
    "31146": 15,
    "6314": 7,
    "1235": 12,
    "2323": 9,
    "9327": 12,
    "2465": 10,
    "1331": 2,
    "2444": 3,
    "5091": 9,
    "6711": 16,
    "3958": 13,
    "4943": 2,
    "21915": 2,
    "8067": 2,
    "1272": 2,
    "2319": 2,
    "23760": 5,
    "942": 4,
    "14443": 20,
    "28648": 14,
    "21840": 16,
    "1022": 20,
    "7552": 8,
    "5684": 2,
    "19982": 9,
    "11908": 2,
    "5477": 5,
    "793": 43,
    "4694": 2,
    "12868": 104,
    "23026": 12,
    "5954": 40,
    "12316": 40,
    "5751": 93,
    "24956": 14,
    "5060": 4,
    "7029": 2,
    "4835": 6,
    "5246": 2,
    "2019": 13,
    "5067": 32,
    "12805": 2,
    "2103": 70,
    "13602": 2,
    "12372": 2,
    "10568": 18,
    "8872": 17,
    "16427": 24,
    "7116": 12,
    "4425": 15,
    "16582": 9,
    "1705": 2,
    "2466": 8,
    "2320": 3,
    "4680": 3,
    "11740": 2,
    "1912": 4,
    "3187": 2,
    "3683": 2,
    "1642": 9,
    "1415": 39,
    "12888": 19,
    "5836": 4,
    "7797": 4,
    "25905": 2,
    "8886": 2,
    "3671": 29,
    "14985": 2,
    "31386": 70,
    "21612": 2,
    "11210": 4,
    "3796": 2,
    "7003": 8,
    "20651": 20,
    "4227": 3,
    "4637": 1,
    "3779": 5,
    "5799": 14,
    "7247": 8,
    "5755": 10,
    "28480": 6,
    "12514": 12,
    "5406": 3,
    "12334": 16,
    "10134": 27,
    "14811": 23,
    "28179": 39,
    "91": 2,
    "18050": 4,
    "29280": 2,
    "22387": 2,
    "5427": 25,
    "14480": 10,
    "4988": 1,
    "3784": 7,
    "2241": 6,
    "2701": 1,
    "3741": 8,
    "3821": 7,
    "9201": 6,
    "1588": 4,
    "1339": 2,
    "14172": 22,
    "2038": 28,
    "14160": 20,
    "573": 46,
    "1238": 14,
    "29939": 2,
    "26706": 1,
    "13733": 70,
    "11286": 1,
    "1519": 17,
    "3864": 16,
    "1083": 11,
    "21076": 15,
    "10129": 7,
    "22213": 4,
    "4148": 13,
    "6830": 3,
    "22191": 4,
    "600": 4,
    "819": 5,
    "1134": 16,
    "17322": 19,
    "31399": 8,
    "21331": 6,
    "4986": 17,
    "11139": 12,
    "9669": 10,
    "30766": 6,
    "7027": 2,
    "13866": 70,
    "20785": 1,
    "16147": 3,
    "10101": 2,
    "16530": 2,
    "4160": 20,
    "609": 12,
    "21401": 4,
    "4221": 5,
    "2055": 6,
    "17217": 1,
    "25507": 1,
    "17135": 1,
    "6667": 14,
    "856": 23,
    "16618": 29,
    "4237": 39,
    "30480": 13,
    "25149": 32,
    "1258": 4,
    "918": 4,
    "5283": 2,
    "15991": 14,
    "24500": 14,
    "21670": 6,
    "19086": 11,
    "9016": 4,
    "1073": 5,
    "1372": 10,
    "5058": 72,
    "3778": 63,
    "3802": 2,
    "4362": 3,
    "1823": 8,
    "18911": 22,
    "27388": 18,
    "6211": 18,
    "12065": 9,
    "13823": 1,
    "4215": 4,
    "5916": 1,
    "9162": 6,
    "12289": 1,
    "10771": 1,
    "8276": 20,
    "8330": 18,
    "10157": 26,
    "932": 3,
    "12420": 19,
    "1905": 1,
    "12009": 1,
    "4171": 35,
    "3985": 10,
    "8223": 1,
    "2614": 3,
    "19829": 1,
    "26522": 9,
    "25547": 7,
    "11688": 2,
    "3267": 2,
    "1059": 24,
    "21900": 8,
    "8230": 2,
    "4714": 6,
    "20641": 12,
    "3764": 26,
    "16031": 2,
    "1085": 9,
    "3840": 5,
    "1406": 11,
    "2247": 4,
    "1367": 2,
    "23490": 2,
    "15718": 2,
    "6369": 3,
    "5953": 3,
    "5185": 3,
    "8418": 2,
    "26342": 5,
    "11195": 3,
    "2501": 21,
    "20636": 6,
    "9317": 4,
    "1271": 4,
    "24267": 2,
    "2115": 8,
    "17950": 2,
    "23650": 2,
    "5187": 4,
    "2440": 12,
    "6612": 4,
    "1826": 7,
    "6042": 18,
    "14119": 16,
    "13966": 6,
    "22079": 2,
    "9152": 7,
    "6769": 3,
    "638": 9,
    "2675": 7,
    "6903": 23,
    "12": 26,
    "4101": 23,
    "13": 26,
    "18350": 7,
    "4778": 13,
    "18420": 1,
    "27943": 7,
    "20338": 2,
    "5982": 2,
    "7765": 4,
    "7684": 2,
    "3673": 4,
    "15350": 1,
    "861": 20,
    "10662": 19,
    "794": 2,
    "11069": 2,
    "12068": 16,
    "7628": 60,
    "8352": 1,
    "7561": 4,
    "6964": 20,
    "7576": 4,
    "19123": 2,
    "18015": 2,
    "10264": 3,
    "23103": 6,
    "7108": 8,
    "14607": 6,
    "6737": 2,
    "4899": 7,
    "2649": 2,
    "6269": 2,
    "22673": 2,
    "4676": 2,
    "922": 2,
    "2189": 2,
    "3094": 12,
    "2131": 6,
    "9971": 8,
    "1884": 3,
    "19197": 5,
    "5285": 4,
    "4238": 2,
    "5649": 2,
    "6624": 21,
    "4380": 4,
    "27148": 2,
    "572": 5,
    "4228": 6,
    "4401": 2,
    "12572": 3,
    "6312": 14,
    "22473": 17,
    "14591": 2,
    "6963": 7,
    "18681": 3,
    "28674": 6,
    "6121": 2,
    "7876": 2,
    "8358": 2,
    "26801": 2,
    "4801": 2,
    "18222": 2,
    "6301": 6,
    "6935": 2,
    "9820": 2,
    "27526": 2,
    "2333": 16,
    "1573": 1,
    "6219": 46,
    "2471": 3,
    "4532": 10,
    "5157": 8,
    "3360": 4,
    "9600": 6,
    "7310": 1,
    "29879": 1,
    "7191": 2,
    "29978": 4,
    "6636": 4,
    "728": 29,
    "25334": 27,
    "1770": 2,
    "9012": 2,
    "5038": 14,
    "6815": 2,
    "3781": 2,
    "1789": 6,
    "9801": 3,
    "25172": 9,
    "6735": 14,
    "10453": 2,
    "652": 6,
    "5194": 2,
    "2778": 4,
    "641": 2,
    "27350": 2,
    "16529": 9,
    "30300": 7,
    "16654": 14,
    "6032": 47,
    "7726": 15,
    "4180": 2,
    "2775": 5,
    "3645": 12,
    "22088": 16,
    "694": 2,
    "689": 2,
    "3879": 6,
    "6714": 2,
    "3900": 2,
    "7335": 2,
    "6578": 6,
    "5920": 2,
    "9066": 20,
    "14210": 18,
    "13174": 4,
    "10107": 2,
    "12821": 4,
    "5763": 5,
    "7290": 3,
    "11405": 2,
    "17171": 2,
    "26491": 2,
    "23511": 2,
    "13083": 2,
    "4548": 2,
    "10145": 8,
    "7507": 2,
    "10449": 2,
    "16818": 6,
    "14382": 7,
    "4561": 6,
    "12257": 16,
    "15631": 2,
    "7337": 2,
    "11996": 2,
    "31221": 9,
    "5624": 2,
    "7231": 9,
    "2178": 13,
    "13655": 2,
    "4229": 19,
    "10517": 2,
    "18374": 23,
    "13424": 2,
    "92": 29,
    "27726": 6,
    "17664": 8,
    "30347": 7,
    "20590": 4,
    "18147": 10,
    "4596": 8,
    "3909": 2,
    "23246": 14,
    "27765": 1,
    "3608": 4,
    "10652": 3,
    "4239": 2,
    "5139": 8,
    "15351": 2,
    "7438": 15,
    "2249": 19,
    "17856": 4,
    "2617": 8,
    "5124": 3,
    "12969": 4,
    "6453": 2,
    "1661": 17,
    "3698": 6,
    "3862": 4,
    "10473": 4,
    "4307": 10,
    "27912": 3,
    "26078": 11,
    "21380": 8,
    "27865": 10,
    "17861": 10,
    "17926": 2,
    "25293": 4,
    "4080": 2,
    "8207": 8,
    "28976": 3,
    "5878": 2,
    "25603": 4,
    "11395": 2,
    "2879": 2,
    "2220": 6,
    "30351": 2,
    "6641": 2,
    "27345": 20,
    "7297": 3,
    "3693": 6,
    "1626": 7,
    "14712": 20,
    "11970": 26,
    "778": 2,
    "14455": 5,
    "17936": 12,
    "30900": 13,
    "7200": 5,
    "10939": 4,
    "13006": 3,
    "4559": 10,
    "14617": 2,
    "28028": 9,
    "9488": 17,
    "14639": 5,
    "183": 2,
    "4834": 12,
    "14451": 2,
    "9323": 19,
    "2612": 6,
    "5819": 4,
    "1616": 2,
    "3462": 2,
    "18035": 2,
    "936": 9,
    "6265": 4,
    "1334": 2,
    "3030": 2,
    "4126": 7,
    "2018": 8,
    "16781": 4,
    "3854": 3,
    "2124": 4,
    "927": 2,
    "2628": 2,
    "3825": 2,
    "7824": 2,
    "12305": 16,
    "1895": 4,
    "13892": 9,
    "8668": 4,
    "26888": 8,
    "9300": 2,
    "28487": 2,
    "8705": 2,
    "4353": 9,
    "19347": 17,
    "15873": 20,
    "16679": 5,
    "15412": 4,
    "21744": 16,
    "5888": 13,
    "8800": 2,
    "17964": 11,
    "595": 17,
    "7100": 3,
    "21222": 8,
    "17271": 2,
    "24273": 6,
    "2127": 6,
    "15262": 1,
    "17093": 1,
    "2516": 1,
    "1885": 1,
    "6649": 1,
    "597": 9,
    "12680": 1,
    "19418": 1,
    "5747": 5,
    "4378": 5,
    "17991": 2,
    "31297": 12,
    "3941": 2,
    "2222": 2,
    "6001": 6,
    "7107": 6,
    "11578": 4,
    "14092": 29,
    "26374": 2,
    "8110": 2,
    "3654": 2,
    "3914": 6,
    "5455": 6,
    "553": 6,
    "1449": 2,
    "7273": 2,
    "3982": 6,
    "550": 2,
    "9933": 2,
    "7478": 14,
    "10567": 10,
    "12747": 4,
    "10933": 10,
    "4368": 9,
    "29263": 4,
    "27707": 4,
    "614": 2,
    "2730": 2,
    "8575": 2,
    "3663": 9,
    "7071": 2,
    "5951": 4,
    "28203": 16,
    "5722": 16,
    "5055": 3,
    "14179": 11,
    "2561": 13,
    "3610": 3,
    "10979": 2,
    "2313": 4,
    "1127": 7,
    "13637": 3,
    "6679": 2,
    "15565": 2,
    "13565": 3,
    "10761": 23,
    "2130": 8,
    "7784": 2,
    "5865": 2,
    "8329": 4,
    "5852": 2,
    "22151": 2,
    "1092": 4,
    "25916": 4,
    "7503": 5,
    "17472": 2,
    "9124": 11,
    "19413": 5,
    "13105": 21,
    "19046": 5,
    "10637": 20,
    "1381": 6,
    "3689": 6,
    "18521": 1,
    "26035": 2,
    "1032": 2,
    "9157": 2,
    "28021": 8,
    "1408": 20,
    "25518": 25,
    "2265": 33,
    "15395": 3,
    "17748": 3,
    "20357": 1,
    "3959": 1,
    "23591": 4,
    "11512": 14,
    "6975": 4,
    "14113": 1,
    "23232": 1,
    "8186": 5,
    "3848": 12,
    "27093": 8,
    "14452": 4,
    "21914": 2,
    "14283": 4,
    "18961": 10,
    "10377": 2,
    "29650": 13,
    "13399": 16,
    "13532": 12,
    "14300": 4,
    "1591": 2,
    "2976": 4,
    "4015": 2,
    "554": 6,
    "3719": 2,
    "2364": 15,
    "16216": 4,
    "4601": 7,
    "4439": 2,
    "16544": 2,
    "5510": 1,
    "9073": 3,
    "9220": 2,
    "12742": 3,
    "23703": 1,
    "3767": 2,
    "11743": 2,
    "5092": 13,
    "31485": 2,
    "16178": 4,
    "2263": 9,
    "2344": 1,
    "3669": 1,
    "4202": 1,
    "3861": 4,
    "12443": 3,
    "4216": 3,
    "27032": 9,
    "21637": 6,
    "13970": 2,
    "27284": 13,
    "6560": 15,
    "3851": 6,
    "4979": 4,
    "4070": 5,
    "3933": 1,
    "9270": 5,
    "8318": 6,
    "2734": 6,
    "18511": 2,
    "8728": 2,
    "27454": 2,
    "6298": 2,
    "13584": 4,
    "10754": 6,
    "10262": 6,
    "4244": 21,
    "1490": 5,
    "4376": 4,
    "20070": 4,
    "5241": 2,
    "27603": 25,
    "24438": 17,
    "25541": 3,
    "11653": 2,
    "2057": 4,
    "1766": 9,
    "1787": 7,
    "7114": 1,
    "4254": 9,
    "3816": 1,
    "5394": 4,
    "24507": 18,
    "22232": 13,
    "24302": 16,
    "28886": 25,
    "25193": 10,
    "5450": 17,
    "6169": 4,
    "19699": 4,
    "4964": 8,
    "6931": 2,
    "13309": 2,
    "8498": 2,
    "11264": 27,
    "3961": 6,
    "13177": 2,
    "15796": 2,
    "11144": 2,
    "15302": 2,
    "994": 2,
    "1812": 2,
    "12213": 2,
    "1377": 4,
    "2816": 6,
    "1297": 3,
    "11628": 3,
    "1251": 2,
    "2906": 2,
    "17287": 2,
    "29493": 2,
    "25256": 2,
    "20721": 2,
    "6625": 9,
    "10661": 2,
    "8973": 2,
    "20049": 6,
    "12240": 11,
    "6562": 6,
    "7805": 2,
    "8944": 4,
    "4826": 5,
    "8336": 2,
    "5346": 7,
    "27008": 3,
    "3614": 2,
    "9519": 4,
    "23517": 3,
    "5561": 3,
    "20830": 2,
    "4543": 10,
    "18503": 6,
    "23614": 3,
    "13289": 17,
    "28141": 2,
    "9999": 2,
    "5141": 2,
    "5100": 11,
    "8202": 2,
    "4507": 6,
    "3635": 18,
    "8010": 7,
    "2014": 4,
    "6909": 2,
    "4414": 2,
    "6902": 2,
    "8244": 2,
    "1161": 2,
    "21700": 2,
    "5429": 2,
    "4348": 20,
    "3269": 2,
    "6616": 1,
    "5372": 1,
    "19168": 2,
    "7263": 6,
    "93": 13,
    "15547": 2,
    "1915": 2,
    "17103": 2,
    "13019": 3,
    "1469": 2,
    "1488": 7,
    "5180": 2,
    "11822": 2,
    "1491": 6,
    "2193": 6,
    "1805": 1,
    "3930": 1,
    "5069": 8,
    "29786": 2,
    "19865": 2,
    "14381": 3,
    "7510": 7,
    "5867": 3,
    "5485": 2,
    "9807": 2,
    "22200": 2,
    "1850": 4,
    "1410": 2,
    "19644": 6,
    "7328": 4,
    "11800": 6,
    "6254": 5,
    "31097": 4,
    "25970": 11,
    "18411": 2,
    "3028": 2,
    "5189": 2,
    "19162": 2,
    "5877": 8,
    "22978": 3,
    "7690": 3,
    "10505": 4,
    "5397": 1,
    "598": 7,
    "17859": 7,
    "11745": 5,
    "5354": 1,
    "4365": 2,
    "16420": 4,
    "2960": 2,
    "9446": 7,
    "4013": 2,
    "6011": 3,
    "4727": 6,
    "2168": 21,
    "7705": 5,
    "28058": 2,
    "1761": 34,
    "22366": 5,
    "5538": 11,
    "6862": 3,
    "29830": 1,
    "9415": 2,
    "11187": 21,
    "21547": 4,
    "26189": 2,
    "2280": 4,
    "7361": 6,
    "4684": 2,
    "13654": 17,
    "26317": 32,
    "6791": 5,
    "772": 45,
    "12977": 1,
    "9149": 29,
    "4599": 1,
    "15717": 2,
    "1972": 2,
    "18908": 2,
    "7326": 6,
    "648": 8,
    "2456": 11,
    "3926": 3,
    "15919": 8,
    "7937": 12,
    "6448": 11,
    "15519": 1,
    "898": 3,
    "3757": 2,
    "14231": 2,
    "16337": 2,
    "3884": 7,
    "4025": 10,
    "4804": 3,
    "6515": 5,
    "1924": 2,
    "12008": 2,
    "3777": 3,
    "6260": 2,
    "2787": 2,
    "9471": 2,
    "4398": 4,
    "5617": 2,
    "812": 2,
    "2059": 2,
    "7754": 4,
    "4619": 6,
    "4818": 4,
    "7170": 4,
    "16221": 4,
    "2823": 2,
    "1599": 2,
    "3728": 2,
    "2372": 2,
    "16980": 2,
    "10671": 2,
    "2401": 4,
    "2483": 30,
    "687": 1,
    "6551": 3,
    "7926": 2,
    "4034": 2,
    "5686": 2,
    "1423": 4,
    "1693": 6,
    "16831": 2,
    "6190": 13,
    "2509": 2,
    "17057": 2,
    "5273": 2,
    "6248": 3,
    "5362": 8,
    "4364": 4,
    "7963": 6,
    "10407": 1,
    "3902": 4,
    "30113": 2,
    "5600": 4,
    "28809": 4,
    "10290": 3,
    "8772": 3,
    "10204": 2,
    "2065": 4,
    "2215": 2,
    "19479": 17,
    "4419": 22,
    "10698": 12,
    "28477": 5,
    "9864": 5,
    "7622": 5,
    "9492": 2,
    "4143": 8,
    "4407": 2,
    "1751": 10,
    "8119": 8,
    "5947": 8,
    "5191": 2,
    "1492": 6,
    "3828": 13,
    "3750": 4,
    "5554": 4,
    "4327": 3,
    "11320": 5,
    "4794": 2,
    "21230": 2,
    "15818": 15,
    "25191": 14,
    "2224": 2,
    "3716": 1,
    "779": 3,
    "3300": 3,
    "9458": 3,
    "7516": 2,
    "552": 16,
    "23115": 4,
    "7652": 4,
    "11946": 2,
    "2682": 2,
    "3681": 5,
    "6701": 4,
    "8525": 4,
    "7265": 2,
    "13191": 2,
    "5672": 2,
    "18179": 2,
    "7089": 4,
    "8089": 7,
    "5028": 11,
    "6059": 6,
    "16510": 2,
    "7350": 4,
    "1676": 4,
    "1672": 6,
    "1801": 2,
    "3428": 2,
    "6296": 4,
    "1370": 6,
    "4226": 2,
    "20997": 7,
    "29062": 2,
    "23269": 5,
    "5527": 8,
    "15478": 3,
    "27490": 4,
    "17199": 2,
    "8609": 1,
    "4941": 1,
    "2534": 1,
    "20969": 5,
    "642": 2,
    "3755": 31,
    "704": 9,
    "5153": 2,
    "8187": 2,
    "30276": 2,
    "15287": 2,
    "22990": 2,
    "19789": 1,
    "2618": 2,
    "5380": 2,
    "6868": 3,
    "10758": 4,
    "11447": 2,
    "8926": 2,
    "6510": 4,
    "957": 6,
    "26512": 9,
    "17270": 1,
    "4341": 2,
    "11398": 2,
    "14995": 6,
    "9946": 3,
    "8260": 21,
    "1256": 2,
    "12021": 2,
    "26960": 13,
    "3901": 5,
    "5046": 2,
    "17027": 2,
    "14069": 4,
    "5468": 2,
    "8812": 2,
    "20580": 2,
    "13262": 1,
    "16073": 3,
    "2257": 3,
    "2406": 4,
    "4011": 6,
    "3627": 2,
    "6974": 8,
    "3264": 6,
    "2780": 7,
    "2542": 4,
    "3653": 2,
    "8801": 2,
    "5424": 2,
    "6354": 3,
    "19958": 4,
    "13412": 6,
    "21073": 2,
    "8191": 4,
    "1455": 4,
    "22476": 2,
    "17006": 5,
    "17609": 9,
    "3135": 4,
    "16917": 2,
    "19877": 2,
    "22216": 5,
    "19751": 2,
    "11439": 4,
    "2883": 2,
    "10708": 1,
    "25238": 1,
    "5126": 1,
    "4374": 15,
    "1042": 19,
    "7241": 4,
    "692": 2,
    "22322": 2,
    "16387": 2,
    "7215": 4,
    "31238": 3,
    "4392": 2,
    "1093": 2,
    "9914": 2,
    "14955": 8,
    "2087": 8,
    "5275": 4,
    "5375": 2,
    "4780": 2,
    "4848": 4,
    "9630": 4,
    "18616": 2,
    "1908": 3,
    "17978": 2,
    "14726": 2,
    "15583": 2,
    "9428": 2,
    "18900": 2,
    "13135": 6,
    "8893": 4,
    "7379": 2,
    "6029": 1,
    "8930": 6,
    "5373": 17,
    "14756": 6,
    "8680": 2,
    "21919": 2,
    "10595": 3,
    "20793": 3,
    "20926": 4,
    "28255": 6,
    "1119": 5,
    "2380": 1,
    "14596": 2,
    "6626": 2,
    "5846": 4,
    "6317": 2,
    "5005": 2,
    "5294": 2,
    "17204": 11,
    "16277": 2,
    "3136": 13,
    "9891": 2,
    "21275": 4,
    "22543": 2,
    "1733": 3,
    "8999": 2,
    "1707": 2,
    "2747": 9,
    "6705": 2,
    "7844": 2,
    "16030": 2,
    "28335": 2,
    "5311": 6,
    "3920": 2,
    "8459": 2,
    "20832": 9,
    "18207": 2,
    "1816": 2,
    "3870": 2,
    "28249": 2,
    "3624": 12,
    "11787": 5,
    "4176": 8,
    "1489": 2,
    "12490": 2,
    "2893": 4,
    "11594": 1,
    "11547": 3,
    "602": 2,
    "5370": 5,
    "8509": 2,
    "5513": 2,
    "6441": 3,
    "6881": 2,
    "3694": 6,
    "2082": 29,
    "5199": 12,
    "10776": 2,
    "2078": 4,
    "1942": 2,
    "2122": 2,
    "30784": 3,
    "4693": 4,
    "6972": 2,
    "22592": 2,
    "17583": 2,
    "4253": 19,
    "9117": 8,
    "5352": 4,
    "13960": 4,
    "10104": 21,
    "4193": 3,
    "8200": 6,
    "17003": 6,
    "4991": 2,
    "2593": 4,
    "13087": 6,
    "5209": 2,
    "31201": 1,
    "2278": 7,
    "7374": 3,
    "4384": 7,
    "8659": 2,
    "1452": 1,
    "2378": 1,
    "15606": 6,
    "4965": 2,
    "2070": 2,
    "17852": 6,
    "13094": 2,
    "5004": 6,
    "22163": 2,
    "23156": 2,
    "5118": 2,
    "11375": 4,
    "6128": 4,
    "10066": 6,
    "4260": 10,
    "19774": 1,
    "3713": 6,
    "3414": 2,
    "23262": 2,
    "13980": 2,
    "2190": 24,
    "6727": 5,
    "7192": 1,
    "16092": 2,
    "4483": 3,
    "23288": 2,
    "15677": 2,
    "29065": 13,
    "7746": 2,
    "7234": 6,
    "2578": 5,
    "4135": 2,
    "2300": 2,
    "1870": 2,
    "1237": 2,
    "2439": 4,
    "14358": 2,
    "19632": 7,
    "9530": 19,
    "13401": 19,
    "5154": 2,
    "30638": 2,
    "9765": 6,
    "2029": 4,
    "2745": 2,
    "4386": 2,
    "26004": 1,
    "2548": 2,
    "2500": 5,
    "29689": 2,
    "21492": 4,
    "10829": 2,
    "6320": 4,
    "31222": 2,
    "12434": 5,
    "10390": 2,
    "5475": 5,
    "1969": 12,
    "2413": 13,
    "1541": 2,
    "10329": 2,
    "6079": 2,
    "17378": 2,
    "10695": 2,
    "8665": 4,
    "2234": 2,
    "12406": 2,
    "14449": 2,
    "5512": 4,
    "10248": 2,
    "2114": 8,
    "12370": 2,
    "6586": 4,
    "2316": 5,
    "4217": 1,
    "6648": 1,
    "6086": 2,
    "10040": 2,
    "4062": 13,
    "8798": 2,
    "7420": 5,
    "8212": 2,
    "14649": 3,
    "10168": 2,
    "22444": 2,
    "4652": 2,
    "3977": 5,
    "15652": 3,
    "25951": 3,
    "8170": 7,
    "11004": 2,
    "17337": 2,
    "1426": 2,
    "820": 4,
    "1715": 4,
    "4165": 6,
    "12838": 2,
    "4267": 11,
    "2098": 11,
    "14230": 3,
    "3846": 5,
    "8049": 2,
    "28291": 1,
    "8359": 5,
    "14524": 2,
    "7282": 8,
    "28998": 1,
    "5052": 2,
    "7569": 3,
    "4550": 1,
    "17200": 2,
    "24154": 7,
    "14112": 2,
    "9703": 2,
    "7975": 2,
    "3005": 2,
    "4192": 2,
    "10919": 2,
    "4614": 2,
    "6344": 2,
    "16548": 2,
    "8148": 2,
    "1938": 2,
    "25043": 3,
    "1714": 3,
    "2310": 3,
    "2559": 4,
    "2557": 2,
    "20180": 2,
    "21263": 2,
    "16399": 2,
    "10016": 2,
    "10019": 4,
    "6514": 2,
    "21734": 2,
    "7115": 4,
    "1579": 2,
    "4052": 1,
    "5713": 4,
    "12970": 5,
    "31016": 3,
    "17526": 2,
    "18981": 2,
    "5655": 4,
    "4594": 2,
    "1226": 3,
    "6309": 2,
    "4535": 6,
    "10068": 15,
    "24355": 2,
    "3708": 2,
    "19555": 2,
    "2869": 2,
    "23354": 2,
    "7529": 2,
    "2258": 5,
    "21184": 2,
    "9003": 2,
    "8004": 1,
    "3919": 3,
    "12757": 4,
    "12227": 4,
    "18354": 2,
    "22245": 2,
    "27728": 3,
    "4208": 2,
    "5634": 2,
    "4146": 2,
    "19509": 2,
    "5547": 3,
    "4573": 2,
    "21080": 3,
    "6255": 1,
    "1094": 3,
    "19174": 1,
    "21845": 2,
    "2266": 2,
    "1132": 2,
    "77": 4,
    "27497": 2,
    "4233": 2,
    "7909": 2,
    "7333": 1,
    "24207": 4,
    "5958": 7,
    "2296": 6,
    "17063": 2,
    "2245": 11,
    "22504": 2,
    "2455": 2,
    "4030": 2,
    "2305": 2,
    "17386": 2,
    "7954": 2,
    "10010": 4,
    "26874": 2,
    "3948": 6,
    "13284": 3,
    "2025": 1,
    "5333": 6,
    "1292": 6,
    "11150": 4,
    "12901": 2,
    "9503": 2,
    "7863": 2,
    "19408": 2,
    "19711": 2,
    "17828": 2,
    "25740": 1,
    "30756": 2,
    "22779": 2,
    "1159": 3,
    "16722": 2,
    "16578": 8,
    "11090": 3,
    "18044": 2,
    "11266": 4,
    "6503": 2,
    "8096": 6,
    "11472": 2,
    "5680": 2,
    "5403": 2,
    "2034": 4,
    "3811": 2,
    "10503": 2,
    "5955": 6,
    "8558": 3,
    "6659": 1,
    "4854": 2,
    "19349": 3,
    "10897": 1,
    "20129": 2,
    "4129": 4,
    "7431": 6,
    "864": 12,
